БухЭксп/Catalogs/CW_ПриложенияКДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПриложенияКДоговорам</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактироватьНаименование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяОграниченияПоГруппамУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаиморасчетыВУЕ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйДоговор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БухгалтерскийУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорДляВыявленияФинансовогоРезультата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговорНаЗакупку</Name>
					<Comment>с клиентом, для расходов по г/п</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговорНаПродажу</Name>
					<Comment>с поставщиком, для доходов по г/п</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВеденияБухгалтерскогоУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьАвтогенерациюЗаявокНаОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_УчетПриложенийДоговоровСервер/Ext/Module.bsl
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Элементы 	= Форма.Элементы;
	Объект 		= Форма.Объект;

	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") 
		ИЛИ ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.CW_ПриложенияКДоговорам") Тогда 
		
		СоответствияИменПоля = ПолучитьСоответствиеИмениПоляОбъектуМетаданных();
		ИмяПоля 			 = СоответствияИменПоля.Получить(Объект.Ссылка.Метаданные().Имя);
		
		УстановитьОтборПриложенийДоговора(Объект, Форма.ПриложенияДоговора.Отбор, ИмяПоля);
		
		Если Элементы.Найти("ИспользуютсяПриложения") <> Неопределено Тогда
			CW_УчетПриложенийДоговоровКлиентСервер.ОбновитьНаличиеДополнительныхСоглашений(Форма);
			CW_УчетПриложенийДоговоровКлиентСервер.УчетПриложенийПриИзменении(Форма)	
		КонецЕсли;
		
	Иначе 
		
		УстановитьПараметрФункциональнойОпции(Форма, Объект);
		
	КонецЕсли;

	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
		Элементы.СтраницаПриложения.Видимость = Объект.ИспользуютсяПриложения;
		Элементы.УчитыватьПриложенияВДокументах.Видимость = Объект.ИспользуютсяПриложения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	Объект 				 = Форма.Объект;
	
	СоответствияИменПоля = ПолучитьСоответствиеИмениПоляОбъектуМетаданных();
	ИмяПоля 			 = СоответствияИменПоля.Получить(Объект.Ссылка.Метаданные().Имя);
	
	УстановитьОтборПриложенийДоговора(Объект, Форма.ПриложенияДоговора.Отбор, ИмяПоля);

КонецПроцедуры

Процедура ПриИзмененииДоговораНаСервере(Форма) Экспорт
	
	УстановитьПараметрФункциональнойОпции(Форма, Форма.Объект);

КонецПроцедуры

Процедура ПриИзмененииКонтрагентаНаСервере(Форма) Экспорт
	
	Форма.Объект.ПриложениеКДоговору = Неопределено;
	
КонецПроцедуры

Процедура УстановитьОтборПриложенийДоговора(Объект, Отбор, ИмяПоля) Экспорт
	
	Отбор.Элементы.Очистить();
	
	ПравоеЗначение = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено);
	
	ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ПравоеЗначение;
	ЭлементОтбора.Использование = Истина;
	
КонецПроцедуры

Функция ПолучитьФлагНаличияПриложений(Ссылка) Экспорт
	
	Возврат Справочники.CW_ПриложенияКДоговорам.ПроверитьНаличиеДополнительныхСоглашенийПоОбъекту(Ссылка);
	
КонецФункции

Функция ПолучитьСоответствиеИмениПоляОбъектуМетаданных()
	
	Результат = Новый Соответствие;
	Результат.Вставить("CW_ДоговорыПоГрузоперевозкам", 	"Договор");
	Результат.Вставить("CW_ПриложенияКДоговорам", 		"Родитель");
	
	Возврат Результат;
	
	
КонецФункции

Процедура УстановитьПараметрФункциональнойОпции(Форма, ДанныеОбъекта) Экспорт
	
	УстанавиливаемыеПараметры = Новый Структура("CW_ДоговорПоГрузоперевозкам", ДанныеОбъекта.Договор);
	Форма.УстановитьПараметрыФункциональныхОпцийФормы(УстанавиливаемыеПараметры);
	
КонецПроцедуры

Функция ПолучитьПризнакУчетаПриложенийПоДоговору(Договор) Экспорт
	
	Возврат Договор.ИспользуютсяПриложения; 
	
КонецФункции

Процедура УстановитьПризнакУчетаПоПриложениямВТабличнойЧасти(Форма, ИмяТаблицы, ИмяРеквизитаДоговор="") Экспорт

	Объект = Форма.Объект;
	ИмяРеквизита =?(ИмяРеквизитаДоговор="", "Договор", ИмяРеквизитаДоговор);
	
	Для каждого СтрокаДокумента Из Объект[ИмяТаблицы] Цикл
		СтрокаДокумента.УчетПриложенийПоДоговору = CW_УчетПриложенийДоговоровСервер.ПолучитьПризнакУчетаПриложенийПоДоговору(СтрокаДокумента[ИмяРеквизита]);
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьВалютуПриложенияДоговора(Знач ПриложениеКДоговору, Знач Договор) Экспорт
	
	Если ЗначениеЗаполнено(ПриложениеКДоговору) Тогда
		ВалютаДоговора 	= ПриложениеКДоговору.ВалютаДоговора;
	Иначе
		ВалютаДоговора 	= Договор.ВалютаДоговора;
	КонецЕсли;
	
	Возврат ВалютаДоговора;
	
КонецФункции  

Функция ПолучитьИдентификаторГосКонтрактаПриложенияДоговора(Знач ПриложениеКДоговору, Знач Договор) Экспорт  

	ФункциональнаяОпция = Метаданные.ФункциональныеОпции.Найти("ИспользуетсяГособоронзаказ");
	Если ФункциональнаяОпция = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользуетсяГособоронзаказ") Тогда
		Возврат Неопределено;
	КонецЕсли;
		      
	Если ЗначениеЗаполнено(ПриложениеКДоговору) Тогда
		ГосударственныйКонтракт = ПриложениеКДоговору.УчетныйДоговор.ГосударственныйКонтракт;
	Иначе
		ГосударственныйКонтракт = Договор.УчетныйДоговор.ГосударственныйКонтракт;
	КонецЕсли;
	
	Возврат СокрЛП(ГосударственныйКонтракт.Код);
	
КонецФункции
